p_karmanVortex/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


scale   1.0;
radius	2.5;

xLeft	#calc	"-23*$radius";
xRight	#calc	"40*$radius";
yTop	#calc	"25*$radius";
yBottom	#calc	"-25*$radius";


vertices
(
    ($xLeft $yBottom -0.5)
    ($xRight $yBottom -0.5)
    ($xRight $yTop -0.5)
    ($xLeft $yTop -0.5)
    ($xLeft $yBottom 0.5)
    ($xRight $yBottom 0.5)
    ($xRight $yTop 0.5)
    ($xLeft $yTop 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 150 2) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch; // generic boudnary condition
        faces
        (
			(0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
			(2 6 5 1)
        );
    }
	topAndBottom
	{
		type patch;
		faces
		(
			(3 7 6 2)
            (1 5 4 0)
		);
	}
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
